{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_66", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "normalization_13_input"}}, {"class_name": "Normalization", "config": {"name": "normalization_13", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "axis": [-1], "mean": null, "variance": null}}, {"class_name": "Dense", "config": {"name": "dense_223", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_224", "trainable": true, "dtype": "float32", "units": 24, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_225", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_226", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adadelta", "config": {"name": "Adadelta", "learning_rate": 0.004999999888241291, "decay": 0.0, "rho": 0.949999988079071, "epsilon": 1e-07}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_223/kernel", "shape": [8, 32], "dtype": "float32"}, {"name": "dense_223/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_224/kernel", "shape": [32, 24], "dtype": "float32"}, {"name": "dense_224/bias", "shape": [24], "dtype": "float32"}, {"name": "dense_225/kernel", "shape": [24, 8], "dtype": "float32"}, {"name": "dense_225/bias", "shape": [8], "dtype": "float32"}, {"name": "dense_226/kernel", "shape": [8, 1], "dtype": "float32"}, {"name": "dense_226/bias", "shape": [1], "dtype": "float32"}, {"name": "mean", "shape": [8], "dtype": "float32"}, {"name": "variance", "shape": [8], "dtype": "float32"}, {"name": "count", "shape": [], "dtype": "int32"}]}]}